
using ByReplace.Commands.Handlers;

namespace ByReplace.Commands.Logo
{
    internal class PrintLogoCommand : ICommand
    {
        public ValueTask ExecuteAsync(CancellationToken cancellationToken = default)
        {
            const string logoAscii = @"              
     
                ,¿q▄▄▌██▓▓▓███████▌▄,              ,,,,,¿q▄▄▄▄▌▌▌▌▌▌▌▌▄▄µ
          ¿▄▌█▓▓▓▓▓▓████▒▀▀▀▀▀▀██▓▓▓█▌µ          ╒█▓▓▓▓▓▓▓▓▓▓▓▓█▒▒▒██▓▓▓▓▓█▄
       ¿▌▓▓▓▓▓▓▓▓▀▀╙             ²▓▓▓▓█           ▀▓▓▓▓▓╜             `▀▓▓▓▓▓µ
       Ñ▒▒█▓▓▓▓▓M                 █▓▓▓▓M          ]▓▓▓▓                  Ñ▓▓▓▓µ
           ██▓▓▌                 ▄▓▓▓▓▀           █▓▓▓▌                   ▓▓▓▓&
           ██▓▓&               ¿█▓▓▓█`           ]▓▓▓▓                   ]▓▓▓▓`
          ]██▓▓              ▄█▓▓▓▒╜             Ñ▓▓▓▌                  ▄█▓▓▓M
          ▐▓▓▓▌          ,q▌▓▓▓▓▀`               ▓▓▓▓M               ,▄▓▓▓▓▀
          █▓▓█M     ,¿▄▌███▓▓▓▓█▄µ              ▐▓▓▓▓            ,¿▄▓▓▓▓▓▀
         ]█▓▓█    ]█▓▓▓▓▓█▒▀▒██▒▓▓▒▌w           █▓▓▓▌   ç▄▄▄▄æg#███▒▓▒▀`
         ▐█▓▓▒     ╙╨╨╜`       `▀▒▓▓▓█µ         ▒▓▓▓M  Ñ▓▓▓▓▓████▀╜`
         ████&                    █████        ]█▒▒█    `╙╙▀██████▄
        ]████                     ▐████Ω       Ñ▒▒▒▌         `▀█████▌µ
        ▐███▌                     ████▌        Ñ▌▌▌▌            ╙▀▒▒ÅÑ▌▄µ
        Ñ▒██▀                   ¿Ñ██▒▀         ▌▀▀Ñ&               ╨▀▀Ñ▀▌▌▄µ
       ]▌ÑÑÑ[                ,q▌▄▐▒▒╜         ]▌▀▀▀&                 `╝Ñå▀Ñ█▒▄µ
       Ñ▌▌▌▌[             ¿q▀▌▌▌▌▌┘           ]▀Ñ▀▀&                    ╙▀▀▀▀▌▌▌&µ
       Ñ░▀▀▀M   ╓▄▄#╗æ#▀▌▒▒▀Ñ▀▀╨               ▀ååå▀                       ╙▀▀▀▀▀▌
        ╨▀▀╨   ▀É░▀▒@░░░░▀▌▀╙                  └▀▀╝`                          `╙`";

            Console.WriteLine(logoAscii);

            return new ValueTask();
        }
    }
}
